#include <iostream>
#include <windows.h>
using namespace std;

int lab_22(){
    system("chcp 65001");

    string n1,n2,n3,n4,m1,m2,m3,m4,b1,b2,b3,b4;

    cout<<"1. Введіть: найменування,виробника, кількість пакетів, вартість >";
    cin>>n1>>n2>>n3>>n4;
    cout<<"2. Введіть: найменування,виробника, кількість пакетів, вартість >";
    cin>>m1>>m2>>m3>>m4;
    cout<<"3. Введіть: найменування,виробника, кількість пакетів, вартість >";
    cin>>b1>>b2>>b3>>b4;
    cout<<"|----------------------------------------------------|\n";
    cout<<"|Офісні пакети                                       |\n";
    cout<<"|----------------------------------------------------|\n";
    cout<<"| Найменування   | Виробник | Кількість  | Вартість  |\n";
    cout<<"|                |          | пакетів    |    ($)    |\n";
    cout<<"|----------------|----------|------------|-----------|\n";
    cout<<"|"<<n1<<"          |"<<n2<<" |"<<n3<<"           |"<<n4<<"        |\n";
    cout<<"|"<<m1<<"       |"<<m2<<"     |"<<m3<<"           |"<<m4<<"       |\n";
    cout<<"|"<<b1<<"      |"<<b2<<"       |"<<b3<<"           |"<<b4<<"          |\n";
    cout<<"|----------------------------------------------------|\n";
    cout<<"|Примітка: можна безкоштовно отримати                |\n";
    cout<<"|продукт StarOffice через Internet                   |\n";
    cout<<"|----------------------------------------------------|\n";

/*
Office Microsoft 4 870
SmartSute Lotus 5 1020
StarOffice Sun 4 9
 */



    return 0;
}


